ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/СчетФактураВыданныйАванс/СчетФактураВыданныйАванс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="dd2b2f65-200c-417f-9c69-e6ba676d4f32">
  <name>СчетФактураВыданныйАванс</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="eaa15004-0129-4f2f-b380-91bd0636a143">
    <name>СчетФактураОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4453db2b-42d8-4ab5-9db6-987426562b07">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПредставлениеНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="979024a8-b1fd-4919-8b1f-0895a8442f5f">
    <name>ДокументыАвансовКомитента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="19ef7f02-beab-46fa-9490-fa0f74567671">
      <name>РасчетныйДокумент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/СчетФактураВыданныйАванс/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает представление номера переданного счета-фактуры.
// Учитывается цифровой индекс обособленного подразделения.
//
// Параметры:
//  СчетФактураОбъект - ДокументОбъект.СчетФактураВыданный - для вызова перед записью документа
//
// Возвращаемое значение:
//  Строка - представление номера переданного счета-фактуры
//
Функция ПолучитьПредставлениеНомера(СчетФактураОбъект) Экспорт
	
	ТаблицаСчетовФактур = Новый ТаблицаЗначений;
	ТаблицаСчетовФактур.Колонки.Добавить("СчетФактура", Новый ОписаниеТипов("ДокументСсылка.СчетФактураВыданныйАванс"));
	ТаблицаСчетовФактур.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	ТаблицаСчетовФактур.Колонки.Добавить("ДокументОснование", Документы.ТипВсеСсылки());
	ТаблицаСчетовФактур.Колонки.Добавить("Исправление", Новый ОписаниеТипов("Булево"));
	ТаблицаСчетовФактур.Колонки.Добавить("СчетФактураОснование", Новый ОписаниеТипов("ДокументСсылка.СчетФактураВыданныйАванс"));
	ТаблицаСчетовФактур.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	
	НоваяСтрока = ТаблицаСчетовФактур.Добавить();
	НоваяСтрока.СчетФактура = СчетФактураОбъект.Ссылка;
	НоваяСтрока.Номер = СчетФактураОбъект.Номер;
	НоваяСтрока.ДокументОснование = ?(СчетФактураОбъект.ДокументыОснования.Количество() = 0, Неопределено,
		СчетФактураОбъект.ДокументыОснования[0].ДокументОснование);
	НоваяСтрока.Исправление = СчетФактураОбъект.Исправление;
	НоваяСтрока.СчетФактураОснование = СчетФактураОбъект.СчетФактураОснование;
	НоваяСтрока.Организация = СчетФактураОбъект.Организация;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Т.СчетФактура КАК Документ.СчетФактураВыданныйАванс) КАК СчетФактура,
	|	Т.Номер,
	|	Т.ДокументОснование,
	|	Т.Исправление,
	|	Т.СчетФактураОснование,
	|	Т.Организация
	|ПОМЕСТИТЬ вт_ТаблицаСчетовФактур
	|ИЗ
	|	&ТаблицаСчетовФактур КАК Т";
	
	Запрос.УстановитьПараметр("ТаблицаСчетовФактур", ТаблицаСчетовФактур);
	Запрос.Выполнить();
	
	Результат = РассчитатьПредставлениеНомеров(Запрос.МенеджерВременныхТаблиц);
	
	Возврат Результат.Получить(СчетФактураОбъект.Ссылка);
	
КонецФункции

Функция РассчитатьПредставлениеНомеров(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт_ТаблицаСчетовФактур.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	вт_ТаблицаСчетовФактур КАК вт_ТаблицаСчетовФактур
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацииВНалоговомОргане.СрезПоследних КАК Регистрации
	|		ПО вт_ТаблицаСчетовФактур.Организация = Регистрации.Организация
	|			И (НЕ Регистрации.РегистрацияВНалоговомОргане.ЦифровойИндексОбособленногоПодразделения = 0)
	|ГДЕ
	|	НЕ Регистрации.РегистрацияВНалоговомОргане ЕСТЬ NULL
	|	И НЕ вт_ТаблицаСчетовФактур.ДокументОснование = НЕОПРЕДЕЛЕНО
	|	И НЕ вт_ТаблицаСчетовФактур.ДокументОснование ССЫЛКА Документ.ПервичныйДокумент";
	
	УстановитьПривилегированныйРежим(Истина);
	МассивОснований = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументОснование");
	УстановитьПривилегированныйРежим(Ложь);
	
	Если МассивОснований.Количество() = 0 Тогда
		ТаблицаДанныхДокументов = Новый ТаблицаЗначений;
		ТаблицаДанныхДокументов.Колонки.Добавить("Ссылка", Документы.ТипВсеСсылки());
		ТаблицаДанныхДокументов.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ТаблицаДанныхДокументов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
		
		Запрос.Текст = "ВЫБРАТЬ Т.* ПОМЕСТИТЬ ТаблицаДанныхДокументов ИЗ &ТаблицаДанныхДокументов КАК Т";
		Запрос.УстановитьПараметр("ТаблицаДанныхДокументов", ТаблицаДанныхДокументов);
		Запрос.Выполнить();
	Иначе
		ПоместитьВременнуюТаблицуДанныхОснований(МенеджерВременныхТаблиц, МассивОснований);
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетФактураВыданный.СчетФактура КАК СчетФактура,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Исправление
	|			ТОГДА СчетФактураВыданный.СчетФактураОснование.Номер
	|		ИНАЧЕ СчетФактураВыданный.Номер
	|	КОНЕЦ КАК Номер,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеСкладов.РегистрацияВНалоговомОргане ЕСТЬ NULL
	|			ТОГДА ДанныеСкладов.РегистрацияВНалоговомОргане.ЦифровойИндексОбособленногоПодразделения
	|		КОГДА НЕ ДанныеПодразделений.РегистрацияВНалоговомОргане ЕСТЬ NULL
	|			ТОГДА ДанныеПодразделений.РегистрацияВНалоговомОргане.ЦифровойИндексОбособленногоПодразделения
	|		КОГДА ЕСТЬNULL(Организации.ОбособленноеПодразделение, ЛОЖЬ)
	|			ТОГДА Организации.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЦифровойИндекс
	|ИЗ
	|	вт_ТаблицаСчетовФактур КАК СчетФактураВыданный
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхДокументов КАК ДанныеОснований
	|		ПО СчетФактураВыданный.ДокументОснование = ДанныеОснований.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО СчетФактураВыданный.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацииВНалоговомОргане.СрезПоследних КАК ДанныеСкладов
	|		ПО СчетФактураВыданный.Организация = ДанныеСкладов.Организация
	|			И (ДанныеСкладов.Подразделение = ДанныеОснований.Склад.Подразделение)
	|			И (НЕ ДанныеСкладов.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацииВНалоговомОргане.СрезПоследних КАК ДанныеПодразделений
	|		ПО СчетФактураВыданный.Организация = ДанныеПодразделений.Организация
	|			И (ДанныеПодразделений.Подразделение = ДанныеОснований.Подразделение)
	|			И (НЕ ДанныеПодразделений.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))";
	
	Результат = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Номер = УчетНДСПереопределяемый.НомерСчетаФактурыНаПечать(
			Выборка.Номер,
			Истина,
			ЗначениеЗаполнено(Выборка.ЦифровойИндекс),
			Выборка.ЦифровойИндекс);
		Результат.Вставить(Выборка.СчетФактура, Номер);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ПоместитьВременнуюТаблицуДанныхОснований(МенеджерВременныхТаблиц, МассивОснований)
	
		Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Если Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("СчетаФактурыОснования") = Неопределено
		 И Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("вт_ТаблицаСчетовФактур") <> Неопределено Тогда 
		 
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаОснований.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА НЕ ТаблицаОснований.Ссылка.Корректировочный
		|				И НЕ ТаблицаОснований.Ссылка.Исправление
		|				И НЕ ТаблицаОснований.Ссылка.Перевыставленный
		|				И НЕ ТаблицаОснований.Ссылка.НДССМежценовойРазницы
		|			ТОГДА ТаблицаОснований.ДокументОснование
		|		ИНАЧЕ ТаблицаОснований.Ссылка
		|	КОНЕЦ КАК ДокументОснование,
		|	ТаблицаОснований.Ссылка.Корректировочный КАК Корректировочный,
		|	ТаблицаОснований.Ссылка.Дата КАК Дата,
		|	ТаблицаОснований.Ссылка.РеализацияЧерезКомиссионера КАК РеализацияЧерезКомиссионера
		|ПОМЕСТИТЬ СчетаФактурыОснования
		|ИЗ
		|	Документ.СчетФактураВыданныйАванс.ДокументыОснования КАК ТаблицаОснований
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ТаблицаСчетовФактур КАК вт_ТаблицаСчетовФактур
		|		ПО ТаблицаОснований.Ссылка = вт_ТаблицаСчетовФактур.СчетФактура";
		Запрос.Выполнить();
		
	КонецЕсли;
	
	ТипыОснований = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОснований);
	
	ТекстЗапроса           = "";
	ПервыйТип              = Истина;
	
	Для Каждого ТипОснования Из ТипыОснований Цикл
		
		ОбъектыТипа = ТипОснования.Значение;
		ИмяОбъекта  = Сред(ТипОснования.Ключ, 10);
		
		Запрос.Параметры.Вставить("ДокументОснование_" + ИмяОбъекта, ОбъектыТипа);
		
		Если Не ПустаяСтрока(ТекстЗапроса) Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|";
		КонецЕсли;
		
		МенеджерОбъекта = ОбщегоНазначенияУТ.ПолучитьМодульЛокализации(ИмяОбъекта);
		Если МенеджерОбъекта = Неопределено Тогда
			МенеджерОбъекта = Документы[ИмяОбъекта];
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса +
			МенеджерОбъекта.ТекстЗапросаДанныхОснованияДляПечатнойФормыСчетФактура();
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"//ОператорПОМЕСТИТЬ", ?(ПервыйТип, "ПОМЕСТИТЬ ТаблицаДанныхДокументовПредварительная", ""));
			
		ПервыйТип = Ложь;
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Определяем период для получения КПП с учетом истории и статуса крупнейшего налогоплательщика.
	|
	|ВЫБРАТЬ
	|	ДанныеОснований.Ссылка                КАК Ссылка,
	|	ДанныеОснований.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеОснований.Валюта                КАК Валюта,
	|	ДанныеОснований.Организация           КАК Организация,
	|	ДанныеОснований.НалогообложениеНДС    КАК НалогообложениеНДС,
	|	ДанныеОснований.Подразделение         КАК Подразделение,
	|	ДанныеОснований.Склад                 КАК Склад,
	|	ДанныеОснований.Грузоотправитель      КАК Грузоотправитель,
	|	ДанныеОснований.Грузополучатель       КАК Грузополучатель,
	|
	|	ДанныеОснований.РасчетыЧерезОтдельногоКонтрагента КАК РасчетыЧерезОтдельногоКонтрагента,
	|
	|	ДанныеОснований.Номенклатура          КАК Номенклатура,
	|	ДанныеОснований.Содержание            КАК Содержание,
	|	ДанныеОснований.Комиссионер           КАК Комиссионер,
	|	ДанныеОснований.Основание             КАК Основание,
	|	ДанныеОснований.ОснованиеДата         КАК ОснованиеДата,
	|	ДанныеОснований.ОснованиеНомер        КАК ОснованиеНомер,
	|
	|	ДанныеОснований.БанковскийСчетОрганизации      КАК БанковскийСчетОрганизации,
	|	ДанныеОснований.БанковскийСчетКонтрагента      КАК БанковскийСчетКонтрагента,
	|	ДанныеОснований.БанковскийСчетГрузоотправителя КАК БанковскийСчетГрузоотправителя,
	|	ДанныеОснований.БанковскийСчетГрузополучателя  КАК БанковскийСчетГрузополучателя,
	|
	|	ДанныеОснований.ДоверенностьНомер     КАК ДоверенностьНомер,
	|	ДанныеОснований.ДоверенностьДата      КАК ДоверенностьДата,
	|	ДанныеОснований.ДоверенностьВыдана    КАК ДоверенностьВыдана,
	|	ДанныеОснований.ДоверенностьЛицо      КАК ДоверенностьЛицо,
	|	ДанныеОснований.Менеджер              КАК Менеджер,
	|	ДанныеОснований.Кладовщик             КАК Кладовщик,
	|	ДанныеОснований.ДолжностьКладовщика   КАК ДолжностьКладовщика,
	|	ДанныеОснований.АдресДоставки         КАК АдресДоставки,
	|
	|	ЕСТЬNULL(СчетаФактурыОснования.Дата,
	|				ДанныеОснований.Период)   КАК Период
	|
	|ПОМЕСТИТЬ ТаблицаДанныхДокументов
	|
	|ИЗ
	|	ТаблицаДанныхДокументовПредварительная КАК ДанныеОснований
	|	ЛЕВОЕ СОЕДИНЕНИЕ СчетаФактурыОснования КАК СчетаФактурыОснования
	|	ПО ДанныеОснований.Ссылка = СчетаФактурыОснования.ДокументОснование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|УНИЧТОЖИТЬ ТаблицаДанныхДокументовПредварительная
	|";
	
	Запрос.Текст = ТекстЗапроса;
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПустойТекстЗапросаШапокОснований()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО                                               КАК Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)  КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)                   КАК Валюта,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)              КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК НалогообложениеНДС,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)     КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)                   КАК Склад,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)              КАК Грузоотправитель,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)              КАК Грузополучатель,
	|	ЛОЖЬ                                                       КАК РасчетыЧерезОтдельногоКонтрагента,
	|	НЕОПРЕДЕЛЕНО                                               КАК Номенклатура,
	|	""""                                                       КАК Содержание,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)              КАК Комиссионер,
	|	""""                                                       КАК Основание,
	|	ДАТАВРЕМЯ(1,1,1)                                           КАК ОснованиеДата,
	|	""""                                                       КАК ОснованиеНомер,
	|	НЕОПРЕДЕЛЕНО                                               КАК БанковскийСчетОрганизации,
	|	НЕОПРЕДЕЛЕНО                                               КАК БанковскийСчетКонтрагента,
	|	НЕОПРЕДЕЛЕНО                                               КАК БанковскийСчетГрузоотправителя,
	|	НЕОПРЕДЕЛЕНО                                               КАК БанковскийСчетГрузополучателя,
	|	""""                                                       КАК ДоверенностьНомер,
	|	ДАТАВРЕМЯ(1,1,1)                                           КАК ДоверенностьДата,
	|	""""                                                       КАК ДоверенностьВыдана,
	|	""""                                                       КАК ДоверенностьЛицо,
	|	""""                                                       КАК Менеджер,
	|	""""                                                       КАК Кладовщик,
	|	""""                                                       КАК ДолжностьКладовщика,
	|	""""                                                       КАК АдресДоставки,
	|	""""                                                       КАК ДанныеТранспортнаяНакладная,
	|	""""                                                       КАК СопроводительныеДокументы,
	|	""""                                                       КАК КодСпециальныхОбстоятельств,
	|	""""                                                       КАК АдресДоставкиЗначенияПолей,
	|	""""                                                       КАК АдресДоставкиЗначение
	|ПОМЕСТИТЬ ТаблицаШапокДокументов";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&ИзменениеИКонтроль("ЗаполнитьПараметрыИнициализации")
Процедура vs_ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)

	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                                                            КАК Ссылка,
	|	ДанныеДокумента.Дата                                                              КАК Период,
	|	ДанныеДокумента.Организация                                                       КАК Организация,
	|	ДанныеДокумента.Контрагент                                                        КАК Контрагент,
	|	ДанныеДокумента.Контрагент                                                        КАК Покупатель,
	|	ДанныеДокумента.ДокументОснование                                                 КАК ДокументОплаты,
	|	ДанныеДокумента.ДокументОснование                                                 КАК ДокументОснование,
	|	ДанныеДокумента.ПравилоОтбораАванса                                               КАК ПравилоОтбораАванса,
	|	ДанныеДокумента.ДатаПолученияАванса                                               КАК ДатаПолученияАванса,
	|	ДанныеДокумента.ДатаВыставления                                                   КАК ДатаВыставления,
	|	ДанныеДокумента.Номер                                                             КАК Номер,
#Вставка
	|	ДанныеДокумента.ПредставлениеНомера                                               КАК ПредставлениеНомера,
#КонецВставки
	|	ДанныеДокумента.Дата                                                              КАК Дата,
	|	ДанныеДокумента.ВыставленВЭлектронномВиде                                         КАК ВыставленВЭлектронномВиде,
	|	ДанныеДокумента.Исправление                                                       КАК Исправление,
	|	ДанныеДокумента.НомерИсправления                                                  КАК НомерИсправления,
	|	ДанныеДокумента.СчетФактураОснование                                              КАК СчетФактураОснование,
	|	ДанныеДокумента.СчетФактураОснование.Дата                                         КАК ДатаСчетаФактурыОснования,
	|	ДанныеДокумента.СчетФактураОснование.Номер                                        КАК НомерСчетаФактурыОснования,
	|	ДанныеДокумента.Корректировочный                                                  КАК Корректировочный,
	|	ДанныеДокумента.Подразделение                                                     КАК Подразделение,
	|	ДанныеДокумента.Ответственный                                                     КАК Ответственный,
	|	ДанныеДокумента.РучнаяКорректировкаЖурналаСФ                                      КАК РучнаяКорректировкаЖурналаСФ,
	|	ДанныеДокумента.Проведен                                                          КАК Проведен,
	|	ДанныеДокумента.Сумма                                                             КАК Сумма,
	|	ДанныеДокумента.Комментарий                                                       КАК Комментарий,
	|	ДанныеДокумента.ПометкаУдаления                                                   КАК ПометкаУдаления,
	|	ДанныеДокумента.КодВидаОперации                                                   КАК КодВидаОперации,
	|	ДанныеДокумента.ДоговорКомиссии.Контрагент                                        КАК Комиссионер
	|ИЗ
	|	Документ.СчетФактураВыданныйАванс КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка";

	Результат = Запрос.Выполнить();
	Реквизиты = Результат.Выбрать();
	Реквизиты.Следующий();

	Для Каждого Колонка Из Результат.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[Колонка.Имя]);
	КонецЦикла;

	Запрос.УстановитьПараметр("ТипыЗапасовСобственные",     УчетНДСУПСлужебный.ТипыЗапасовСобственные());
	Запрос.УстановитьПараметр("ИдентификаторМетаданных",    ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ДокументСсылка)));
	Запрос.УстановитьПараметр("Валюта",                     ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Реквизиты.Организация));
	Запрос.УстановитьПараметр("ВалютаРеглУчета",            ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Реквизиты.Организация));
	Запрос.УстановитьПараметр("ВалютаУпрУчета",             Константы.ВалютаУправленческогоУчета.Получить());

#Удаление
	НомерНаПечать = Реквизиты.Номер;
#КонецУдаления
#Вставка
// Здесь можно описать новое поведение.
	НомерНаПечать = Реквизиты.ПредставлениеНомера;

#КонецВставки
	СчетФактураВыданныйАвансЛокализация.УстановитьНомерНаПечать(НомерНаПечать, Реквизиты);
	Запрос.УстановитьПараметр("НомерНаПечать", НомерНаПечать);

	Если ТипЗнч(Реквизиты.ДокументОснование) = Тип("ДокументСсылка.ВводОстатков")
		ИЛИ ТипЗнч(Реквизиты.ДокументОснование) = Тип("ДокументСсылка.ВводОстатковВзаиморасчетов")
		ИЛИ ТипЗнч(Реквизиты.ДокументОснование) = Тип("ДокументСсылка.ПервичныйДокумент") Тогда
		ВводОстатков = Истина;
		ВводОстатковОтражатьВУУ = УчетНДСУПСлужебный.ВводОстатковОтражатьВУУ(Реквизиты.ДокументОснование);
	Иначе
		ВводОстатков = Ложь;
		ВводОстатковОтражатьВУУ = Ложь;
	КонецЕсли;
	Запрос.УстановитьПараметр("ВводОстатков",            ВводОстатков);
	Запрос.УстановитьПараметр("ВводОстатковОтражатьВУУ", ВводОстатковОтражатьВУУ);

	ИнформацияПоИсправлению = "";
	Если Реквизиты.Исправление
		И ЗначениеЗаполнено(Реквизиты.НомерИсправления) Тогда
		ШаблонСтроки = "ru = 'Исправление %1 от %2'"; // @НСтр
		ИнформацияПоИсправлению = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонСтроки,
		Реквизиты.НомерИсправления,
		Реквизиты.Период);
	КонецЕсли;
	Запрос.УстановитьПараметр("ИнформацияПоИсправлению", ИнформацияПоИсправлению);

	РасчетСебестоимостиПрикладныеАлгоритмы.ЗаполнитьПараметрыИнициализации(Запрос, Реквизиты);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
